@braunsonm which version of terraform provider BIG-IP are u using? 
i tried with latest version i didn't notice any issues

```
resource "bigip_command" "create_partition" {
  commands = ["create auth partition ${var.partition_name} default-route-domain 10"]
  when = "apply"
}

resource "bigip_ltm_pool" "example" {
  name = "/${var.partition_name}/somepool"
}

resource "bigip_ltm_pool_attachment" "attachment" {
  pool = bigip_ltm_pool.example.name
  node = "1.1.1.1:8080"
}

```

here is config i have used and logs:

```
 Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # bigip_command.create_partition will be created
  + resource "bigip_command" "create_partition" {
      + command_result = (known after apply)
      + commands       = [
          + "create auth partition TEST default-route-domain 10",
        ]
      + id             = (known after apply)
      + when           = "apply"
    }

  # bigip_ltm_pool.example will be created
  + resource "bigip_ltm_pool" "example" {
      + allow_nat              = (known after apply)
      + allow_snat             = (known after apply)
      + id                     = (known after apply)
      + load_balancing_mode    = (known after apply)
      + minimum_active_members = (known after apply)
      + monitors               = (known after apply)
      + name                   = "/TEST/somepool"
      + reselect_tries         = (known after apply)
      + service_down_action    = (known after apply)
      + slow_ramp_time         = (known after apply)
    }

  # bigip_ltm_pool_attachment.attachment will be created
  + resource "bigip_ltm_pool_attachment" "attachment" {
      + connection_limit      = (known after apply)
      + connection_rate_limit = (known after apply)
      + dynamic_ratio         = (known after apply)
      + id                    = (known after apply)
      + node                  = "1.1.1.1:8080"
      + pool                  = "/TEST/somepool"
      + priority_group        = (known after apply)
      + ratio                 = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

bigip_command.create_partition: Creating...
bigip_ltm_pool.example: Creating...
bigip_command.create_partition: Creation complete after 3s [id=apply]
bigip_ltm_pool.example: Creation complete after 4s [id=/TEST/somepool]
bigip_ltm_pool_attachment.attachment: Creating...
bigip_ltm_pool_attachment.attachment: Creation complete after 2s [id=/TEST/somepool]

Apply complete! Resources: 3 added, 0 changed, 0 destroyed.
```